relocsrl/scintix-p4/examples/rm-cmp4_usb_msc/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=n
CONFIG_LIBC_NEWLIB=y
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=n
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
CONFIG_FATFS_LFN_NONE=y
CONFIG_FATFS_USE_DYN_BUFFERS=n
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_CMAC_C=n
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=n
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_USB_HOST_HUBS_SUPPORTED=y
